# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDeformedShapeSettings..::..IsEqual Method
AnalysisDisplayDeformedShapeSettings Class See Also
---
Compares two deformed shape settings objects.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsEqual(
	AnalysisDisplayDeformedShapeSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As AnalysisDisplayDeformedShapeSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	AnalysisDisplayDeformedShapeSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayDeformedShapeSettings Deformed shape settings object to compare with.
# ### Return Value
True if objects are equal, false otherwise.
# See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace